<?php
/***************************************************************************
 *                        lang_admin_pafiledb.php [Russian]
 *                        ---------------------------------
 ***************************************************************************/

/***************************************************************************
 *
 *   This program is free software; you can redistribute it and/or modify
 *   it under the terms of the GNU General Public License as published by
 *   the Free Software Foundation; either version 2 of the License, or
 *   (at your option) any later version.
 *
 ***************************************************************************/
/* CONTRIBUTORS
   Переведено на русский: Греков Алексей. tankmod@yandex.ru,
*/

// phpBB2 Plus 1.53 Final Language File Build 

// Categories

$lang['Cat_manage_title'] = 'Управление категориями';
$lang['File_manage_title'] = 'Управление файлами';
$lang['All_files'] = 'Все файлы';
$lang['Approved_files'] = 'Непроверенные файлы';
$lang['Broken_files'] = 'Нерабочие файлы';
$lang['File_cat'] = 'Файл в категорию';
$lang['Maintenance'] = 'Эксплуатация';
$lang['Approve'] = 'Разрешить';
$lang['Unapprove'] = 'Не разрешить';
$lang['File_mode'] = 'Просмотр';
$lang['Approve_selected'] = 'Разрешить выбор';
$lang['Unapprove_selected'] = 'Не разрешить выбор';
$lang['Delete_selected'] = 'Удалить выбор';
$lang['No_file'] = 'Нет файлов';
$lang['Acat'] = 'Категория: Добавить';
$lang['Ecat'] = 'Категория: Редактировать';
$lang['Dcat'] = 'Категория: Удалить';
$lang['Rcat'] = 'Категория: Преобразовать';
$lang['Cat_Permissions'] = 'Права категории';
$lang['User_Permissions'] = 'Права пользователя';
$lang['Group_Permissions'] = 'Права группы';
$lang['User_Global_Permissions'] = 'Глоб. права доступа';
$lang['Group_Global_Permissions'] = 'Глоб. права доступа';
$lang['Acattitle'] = 'Добавить категорию';
$lang['Ecattitle'] = 'Изменить категорию';
$lang['Dcattitle'] = 'Удалить категорию';
$lang['Rcattitle'] = 'Преобразовать категории';
$lang['Catexplain'] = 'Вы можете использовать это меню, чтобы: изменять, удалять и преобразовывать категории. Чтобы добавлять файлы, Вам необходимо иметь хотя бы одну созданную категорию.';
$lang['Rcatexplain'] = 'Вы можете преобразовать категории, чтобы изменить их расположение на странице. Чтобы сделать это, измените их номера. 1 будет первой, 2 будет второй, и т.д. Это не повлияет на подкатегории.';
$lang['Catadded'] = 'Новая категория добавлена';
$lang['Catname'] = 'Название категории';
$lang['Catnameinfo'] = 'Это будет названием категории.';
$lang['Catdesc'] = 'Описание категории';
$lang['Catdescinfo'] = 'Описание файлов в категории';
$lang['Catparent'] = 'Родительская дирректория';
$lang['Catparentinfo'] = 'Если Вы хотите, чтобы эта категория была подкатегорией, выберите категорию, которую Вы хотите сделать подкатегорией.';
$lang['Allow_file'] = 'Разрешить добавить файл';
$lang['Allow_file_info'] = 'Если Вы не позволяете добавлять файл к этой категории, это будет высокоуровневая категория, и Вы можете добавить категорию как подкатегорию  для этой категории, как на форуме.';
$lang['None'] = 'нет';
$lang['Catedited'] = 'Выбранная категория отредактирована.';
$lang['Delfiles'] = 'Что Вы хотите сделать с файлами в этой категории?';
$lang['Do_cat'] = 'Что Вы хотите сделать с подкатегорией в этой категории?';
$lang['Move_to'] = 'Переместить в';
$lang['Catsdeleted'] = 'Выбранные категории удалены.';
$lang['Cdelerror'] = 'Вы не выбрали категорий для удаления.';
$lang['Rcatdone'] = 'Категории преобразованы.';

//Catgories Permission
$lang['View'] = 'Показать';
$lang['Read'] = 'Читать';
$lang['View_file'] = 'Показать файл';
// MX Addon
$lang['Delete_file'] = 'Удалить файл';
$lang['Edit_file'] = 'Изменить файл';
// End
$lang['Upload'] = 'Закачать файл';
$lang['Download_file'] = 'Скачать';
$lang['Rate'] = 'Оценить';
$lang['View_comment'] = 'Показать комментарии';
$lang['Post_comment'] = 'Комментарий';
$lang['Edit_comment'] = 'Редактировать комментарии (н/д)';
$lang['Delete_comment'] = 'Удалить комментарии';
$lang['Category_auth_updated'] = 'Права доступа к категории обновлены.';
$lang['Click_return_catauth'] = 'Нажмите %sЗдесь%s, чтобы вернуться к Правам доступа к категориям.';
$lang['Auth_Control_Category'] = 'Контроль прав доступа к категориям';
$lang['Category_auth_explain'] = 'Здесь Вы можете изменить уровни прав к каждой категории. Помните, что изменение уровня прав категории, изменит и права пользователей в пределах этой категории';
$lang['Select_a_Category'] = 'Выбрать категорию';
$lang['Look_up_Category'] = 'Искать категорию';
$lang['Category'] = 'Категория';
$lang['Auth_Control_Category'] = 'Контроль прав доступа к категориям';

$lang['Category_ALL'] = 'ВСЕ';
$lang['Category_REG'] = 'ЗАРЕГИСТР';
$lang['Category_PRIVATE'] = 'ПРИВАТ';
$lang['Category_MOD'] = 'МОД';
$lang['Category_ADMIN'] = 'АДМИН';

// Configuration
$lang['Settings'] = 'Конфигурация';
$lang['Settingstitle'] = 'Загрузки конфигурации';
$lang['Settingsexplain'] = 'Форма ниже позволит Вам настраивать общие варианты загрузки.';
$lang['Dbname'] = 'Имя базы данных';
$lang['Dbnameinfo'] = 'Это имя базы данных как \'Download Index\'';
$lang['Sitename'] = 'Название сайта';
$lang['Sitenameinfo'] = 'Это - имя вашего сайта для навигационного меню, типа \'Home\'';
$lang['Dburl'] = 'URL базы данных';
$lang['Dburlinfo'] = 'Это - URL к директории, всё установлено';
$lang['Hpurl'] = 'Домашняя страница URL';
$lang['Hpurlinfo'] = 'Это - URL к вашей портальной или домашней странице';
$lang['Topnum'] = 'Топ номер';
$lang['Topnuminfo'] = 'Количество файлов отображённых в Топ X загрузок списка файлов';
$lang['Nfdays'] = 'Кол-во дней файл "новый"';
$lang['Nfdaysinfo'] = 'Кол-во дней файл в списке с иконой \'Новый файл\'. Если установлена 5, то все файлы добавленные в течении 5 дней быдут отображаться с иконой \'Новый файл\'';
$lang['Showva'] = 'Показать \'Все файлы\'';
$lang['Showvainfo'] = 'Выберите, действительно ли Вы хотите иметь \'Все файлы\' отображённые с другими на странице меню';
$lang['Php_template'] = 'PHP в шаблоне';
$lang['Php_template_info'] = 'Это позволит Вам использовать php непосредственно в файлах шаблона';
$lang['Dbdl'] = 'Выкл. закачки';
$lang['Dbdlinfo'] = 'Здесь вы можете сделать секцию закачки недоступной. Это хорошая опция, которую можно использовать при создании и модификции базы данных. Только Администраторы смогут просматривать базу данных';
$lang['Isdisabled'] = 'Секция разгрузки в настоящее время недоступна, пробуйте снова позже.';
$lang['Com_settings'] = 'Параметры комментария';
$lang['Com_allowh'] = 'Разрешить HTML';
$lang['Com_allowb'] = 'Разрешить BBCode';
$lang['Com_allows'] = 'Разрешить Смайлы';
$lang['Com_allowl'] = 'Разрешить ссылки';
$lang['Com_messagel'] = 'По умолчанию \'Нет ссылок\' Сообщение';
$lang['Com_messagel_info'] = 'Если нет ссылок, этот текст будет показан вместо них';
$lang['Com_allowi'] = 'Вкл. картинки';
$lang['Com_messagei'] = 'По умолчанию \'Нет ссылок\' Сообщение';
$lang['Com_messagei_info'] = 'Если картинки не включены, что этот текст будет показан них';
$lang['Max_char'] = 'Максимальное кол-во символов в коментарии';
$lang['Max_char_info'] = 'Если кто пошлёт коментарий больше указанного кол-ва символов, то получит сообщение об ошибке (Ограничение коментария).';
$lang['Settings_changed'] = 'Ваши параметры были успешно обновлены';
$lang['File_per_page'] = 'Кол-во файлов на лист';
$lang['File_per_page_info'] = 'Здесь Вы можете установить кол-во файлов на страницу, если Вы оставляете пустым, кол-во файлов на страницу будет 20.';
$lang['Hotlink_prevent'] = 'Отключить ссылки на файлы';
$lang['Hotlinl_prevent_info'] = 'Выберите "да" если вы не разрешаете ссылки на файлы';
$lang['Hotlink_allowed'] = 'Разрешённые домены для ссылок на файлы';
$lang['Hotlink_allowed_info'] = 'Разрешённые домены для ссылок на файлы (отделённые запятой), на пример, www.phpbb.com, www.forumimages.com';
$lang['Default_sort_method'] = 'Параметры сортировки по умолчанию';
$lang['Default_sort_order'] = 'Направление сортировки по умолчанию';
$lang['Max_filesize'] = 'Максимальный размер файла';
$lang['Max_filesize_explain'] = 'Максимальный размер файла. Если указать 0 то будет \'без размера\'. Эта установка ограничена конфигурацией Вашего сервера. На пример, Если выша конфигурация php позволяет только максимум 2 Мб загрузок, это не может быть изменено Модом.';
$lang['Upload_directory'] = 'Директория загрузки';
$lang['Upload_directory_explain'] = 'Ввести относительно установки phpBB2 до директории загрузки. Например, ввести \'pafiledb/uploads/\' если у вас phpBB2 установлен в http://www.yourdomain.com/phpBB2 и директория загрузки приложений расположена в http://www.yourdomain.com/phpBB2/pafiledb/uploads.';
$lang['Screenshots_directory'] = 'Директория скриншотов';
$lang['Screenshots_directory_explain'] = 'Ввести относительно установки phpBB2 до директории загрузки скриншотов. Например, ввести \'pafiledb/images/screenshots/\' если у вас phpBB2 установлен в http://www.yourdomain.com/phpBB2 и директория загрузки приложений расположена в http://www.yourdomain.com/phpBB2/pafiledb/images/screenshots.';
$lang['Forbidden_extensions'] = 'Запрещенные расширения';
$lang['Forbidden_extensions_explain'] = 'Здесь Вы можете добавить или удалить запрещенные расширения. Необходимо отделить их запятой.';
$lang['Permission_settings'] = 'Параметры прав';
$lang['Auth_search'] = 'Разрешение Поиска';
$lang['Auth_search_explain'] = 'Разрешить поиск определённого типа пользователей';
$lang['Auth_stats'] = 'Статистика прав';
$lang['Auth_stats_explain'] = ' статистику для определённого типа пользователей';
$lang['Auth_toplist'] = 'Разрешить Toplist';
$lang['Auth_toplist_explain'] = 'Разрешить toplist для определённого типа пользователей';
$lang['Auth_viewall'] = 'Показ всех разрешений';
$lang['Auth_viewall_explain'] = 'Показ всех разрешений для определённого типа пользователей';
$lang['Bytes'] = 'Байт';
$lang['KB'] = 'Кб';
$lang['MB'] = 'Мб';


// Custom Field
$lang['Afield'] = 'Все поля: Добавить';
$lang['Efield'] = 'Все поля: Редактировать';
$lang['Dfield'] = 'Все поля: Удалить';
$lang['Mfieldtitle'] = 'Все поля';
$lang['Afieldtitle'] = 'Добавить поле';
$lang['Efieldtitle'] = 'Редактировать поле';
$lang['Dfieldtitle'] = 'Удалить поле';
$lang['Fieldexplain'] = 'Вы можете использовать поля управление выбранными дополнительными полями для добавления, редакции, и удаления этих полей. Вы можете использовать дополнительные поля, чтобы добавить больше информации о файле. На пример, если Вы хотите, чтобы информационная поле поместило в файл \ размер, Вы можете создать дополнительное поле и затем  можете включить файл, устанавливить размеры Добавить/Редактировать страницу файлов. (Короче бред какой-то)';
$lang['Fieldname'] = 'Название поля';
$lang['Fieldnameinfo'] = 'Это - название поля, например \'Размер файла\'';
$lang['Fielddesc'] = 'Описание поля';
$lang['Fielddescinfo'] = 'Это - описание поля, например \'Размер файла в мегабайтах\'';
$lang['Fieldadded'] = 'Общее поле успешно добавилась';
$lang['Fieldedited'] = 'Поле которое Вы выбрали, была успешно отредактировано';
$lang['Dfielderror'] = 'Вы не выбрали поля для удаления';
$lang['Fieldsdel'] = 'Поле которое Вы выбрали, была успешно удалено';

$lang['Field_data'] = 'Настройки';
$lang['Field_data_info'] = 'Введите варианты, из которых пользователь может выбрать. Отделите каждую опцию новой линией (перевод каретки).';
$lang['Field_regex'] = 'Правильное выражение';
$lang['Field_regex_info'] = 'Вы можете требовать, чтобы входное поле соответствовало правильному выражению %s(PCRE)%s.';
$lang['Field_order'] = 'Порядок показа';

// File
$lang['Afile'] = 'Файл: добавить';
$lang['Efile'] = 'Файл: изменить';
$lang['Dfile'] = 'Файл: удалить';
$lang['Afiletitle'] = 'Добавить файл';
$lang['Efiletitle'] = 'Изменить файл';
$lang['Dfiletitle'] = 'Удалить файл';
$lang['Fileexplain'] = 'С помощью этой страницы Вы можете, изменять, и удалять файлы.';
$lang['Upload'] = 'Закачать файл';
$lang['Uploadinfo'] = 'Закачать этот файл';
$lang['Uploaderror'] = 'Этот файл уже существует. Пожалуйста переименуйте файл и повторите снова.';
$lang['Uploaddone'] = 'Этот файл был успешно загружен. URL к файлу';
$lang['Uploaddone2'] = 'Щелкните Здесь, чтобы разместить этот URL в поле URL закачки.';
$lang['Upload_do_done'] = 'Файл закачан.';
$lang['Upload_do_not'] = 'Не закачан.';
$lang['Upload_do_exist'] = 'Файл существует';
$lang['Filename'] = 'Имя файла';
$lang['Filenameinfo'] = 'Это - имя файла, который Вы добавляете, пример \'My Picture.\'';
$lang['Filesd'] = 'Короткое описание';
$lang['Filesdinfo'] = 'Краткое описание файла. Это будет расположено на странице, которая представляет собой список всех файлов в категории, это описание должно быть кратким';
$lang['Fileld'] = 'Полное описание';
$lang['Fileldinfo'] = 'Длинное описание файла. Это подробное описание файла\'лов более длинное описание';
$lang['Filecreator'] = 'Автор';
$lang['Filecreatorinfo'] = 'Указывается автор, не зависит от того, кто файл создал.';
$lang['Fileversion'] = 'Версия файла';
$lang['Fileversioninfo'] = 'Это - версия файла, типа 3.0 или 1.3 Beta';
$lang['Filess'] = 'Скриншот URL';
$lang['Filessinfo'] = 'Это - URL к скриншоту файла. На пример, если бы Вы добавляете Winamp skin, это был бы URL к screenshot Winamp с этой skin. Вы можете ввести URL вручную или оставить пустым, тогда будет отображаться вышеупомянутый скриншот.';
$lang['Filess_upload'] = 'Загрузить скриншот';
$lang['Filessinfo_upload'] = 'Вы можете загрузить скриншот щёлкнум на просмотр';
$lang['Filess_link'] = 'Скриншот как ссылка';
$lang['Filess_link_info'] = 'Если Вы хотите показать скриншот, поскольку ссылка делает это как "да".';
$lang['Filedocs'] = 'URL Документации/Руководства';
$lang['Filedocsinfo'] = 'Это - URL к документации или руководству для файла';
$lang['Fileurl'] = 'URL файла';
$lang['Fileurlinfo'] = 'Это - URL к файлу, который будет загружен. Вы можете набрать это вручную, или Вы можете щелкнуть на просмотр и загрузить вышеупомянутый файл.';
$lang['File_upload'] = 'Файл закачан';
$lang['Fileinfo_upload'] = 'Вы можете загрузить файл, щёлкнув на просмотр';
$lang['Uploaded_file'] = 'Закачанный файл';
$lang['Filepi'] = 'Икона темы';
$lang['Filepiinfo'] = 'Вы можете выбрать икону темы для файла. Икона темы будет показываться рядом с файлом в списке файлов.';
$lang['Filecat'] = 'Категория';
$lang['Filecatinfo'] = 'Категория, которой принадлежит файл.';
$lang['Filelicense'] = 'Лицензия';
$lang['Filelicenseinfo'] = 'Это - лицензионное соглашение, с которым пользователь должен согласиться перед разгрузкой файла.';
$lang['Filepin'] = 'Прикрепить файл';
$lang['Filepininfo'] = 'Выберите, прикреплённый файл или нет. Прикреплённые файлы будут всегда показывать вверху списка файлов.';
$lang['Fileadded'] = 'Новый файл успешно добавлен';
// MX Addon
$lang['Filedeleted'] = 'Файл удален.';
// End
$lang['Fileedited'] = 'Выбранный файл отредактирован.';
$lang['Fderror'] = 'Вы не выбрали фалов для удаления.';
$lang['Filesdeleted'] = 'Выбранный файл удалён.';
$lang['Filetoobig'] = 'Файл слишком большой!';
$lang['Approved'] = 'Одобрен';
$lang['Not_approved'] = '(Не одобрен)';
$lang['Approved_info'] = 'Используйте эту опцию, чтобы сделать файл доступным ползователям.';
$lang['Fchecker'] = 'Проверка файлов';
$lang['File_checker'] = 'Проверка файлов.';
$lang['File_checker_explain'] = 'Здесь Вы можете выполнить проверку файлов в базе данных и файлов в директории закачки.';
$lang['File_saftey'] = 'Проверка файлов будет пытаться удалять все файлы и скриншоты, которые в настоящее время не используются и удалят любые описания файла, где файл был удален и очистит все скриншоты, которые не найдены.<br /><br />Если файлы не находятся в <FONT COLOR="#FF0000">{html_path}</FONT> будет пропущен из соображений безовасности.<br /><br />Пожалуйста удостоверьтесь, что <FONT COLOR="#FF0000">{html_path}</FONT> ссылка которую вы используете для ваших файлов.<br /><br /><b>Предупреждение:</b> Настоятельно рекомендуется что Вы <b><a href="' . append_sid("admin_db_utilities.php?perform=backup") . '" class="genmed">сделали Backup вашей базы данных</a></b>.';
$lang['File_checker_perform'] = 'Выполнить проверку';
$lang['Checker_saved'] = 'Общее записываемое пространство';
$lang['Checker_sp1'] = 'Проверка для записи отсутствующих файлов...';
$lang['Checker_sp2'] = 'Проверка для записи отсутствующих скриншотов...';
$lang['Checker_sp3'] = 'Удаление неиспользуемых файлов...';
$lang['Filedls'] = 'Всего скачано';
$lang['Addtional_field'] = 'Дополнительное место';
$lang['File_not_found'] = 'Указанный файл не найден';
$lang['SS_not_found'] = 'Указанный скриншот не найден';
// License 
$lang['Alicense'] = 'Лицензия: Добавить';
$lang['Elicense'] = 'Лицензия: Редактировать';
$lang['Dlicense'] = 'Лицензия: Удалить';
$lang['Alicensetitle'] = 'Добавить лицензию';
$lang['Elicensetitle'] = 'Редактировать лицензию';
$lang['Dlicensetitle'] = 'Удалить лицензию';
$lang['Licenseexplain'] = 'Здесь вы можете добавлять, редактировать, и удалять лицензионные соглашения. Вы можете выбрать лицензию для файла, добавлять или редактировать текст. Если файл имеет лицензионное соглашение, пользователь должен будет согласиться с ним перед загрузкой файла.';
$lang['Lname'] = 'Имя лиценции';
$lang['Ltext'] = 'Тект лицензии';
$lang['Licenseadded'] = 'Новое лицензионное соглашение успешно добавлено';
$lang['Licenseedited'] = 'Лицензионное соглашение, которое Вы выбрали, было успешно отредактировано';
$lang['Lderror'] = 'Вы не выбрали лицензий, чтобы удалить';
$lang['Ldeleted'] = 'Лицензионные соглашения, которые Вы выбрали, были успешно удалены';
// MX
$lang['License_title'] = 'Лицензия';
// ENd
$lang['Click_return'] = 'Нажмите %sЗдесь%s, чтобы вернуться к предыдущей странице.';
$lang['Click_edit_permissions'] = 'Нажмите %sЗдесь%s, чтобы изменить права доступа к этой категории.';

//Java script messages and php errors
$lang['Cat_name_missing'] = 'Пожалуйста, заполните поле названия категории.';
$lang['Cat_conflict'] = 'You can\'t have a category with no file in side a category that doesn\'t allow files (не могу понять эту хрень)';
$lang['Cat_id_missing'] = 'Пожалуйста, выберите категорию.';
$lang['Missing_field'] = 'Пожалуйста, заполните все обязательные поля.';


//Fields Types

$lang['Input'] = 'Single-Line Text Box';
$lang['Textarea'] = 'Multiple-Line Text Box';
$lang['Radio'] = 'Single-Selection Radio Buttons';
$lang['Select'] = 'Single-Selection Menu';
$lang['Select_multiple'] = 'Multiple-Selection Menu';
$lang['Checkbox'] = 'Multiple-Selection Checkbox';

// MX Addon
$lang['Validation_settings'] = 'Подтверждение закачек.';
$lang['Need_validate'] = 'Подтвердить закачки?';
$lang['Validator'] = 'Цензор';
$lang['PM_notify'] = 'ЛС уведомление цензора(ов) (н/д)';
$lang['Validator_admin_option'] = 'Администратор';
$lang['Validator_mod_option'] = 'Администратор и модератор категории';

$lang['Allow_comments'] = 'Включить комментарии (н/д)';
$lang['Allow_comments_info'] = 'Вкл./Выкл. комментарии в этой категории.';
$lang['Allow_ratings'] = 'Включить оценки (н/д)';
$lang['Allow_ratings_info'] = 'Вкл./Выкл. оценки в этой категории.';

$lang['MCP_title'] = 'Контрольная панель модератора';
$lang['MCP_title_explain'] = 'Здесь модераторы могут управлять файлами.';

$lang['Fileadded_not_validated'] = 'Новый файл был загружен, но модератору (администратору) необходимо его проверить перед публикацией.';

?>
