Subject: Выша учётная запись на {SITENAME} блокирована
Charset: windows-1251

Здравствуйте {USER}

Мы обнаружили ({BAD_LOGINS}) неудачных попыток регистрации учётной записи.
В целях безопасности мы блокировали вас на {SITENAME} на {BLOCK_TIME} минут.

У Вас есть шанс получить доступ к Вашей учётной записи, используя правильный пароль, в {BLOCK_UNTIL}.

Если у вас есть предупреждение и вы этого не делали, свяжитесь с администратором сайта и сообщите об этой проблеме.

Если Вы забыли Ваш пароль, пожалуйста используйте соответствующую ссылку, чтобы получить новый, случайный, пароль.
Конечно, Вы сможете изменить тот случайный пароль.
Вот - несколько подсказок, чтобы создать ваш новый, безопасный, пароль:
- никогда не используйте "простой пароль" подобно вашему дню рождения, имени вашей собаки, и т.д
- используйте комбинацию цифр и букв
- слишком длинный пароль.
- используйте различные пароли на различных сайтах (например, используте наименование саита на котором вы находитель в вашем стандартном пароле)



{EMAIL_SIG}
