Subject: У Вас имеется предупреждение
Charset: windows-1251

Здравствуйте, {WARNED_POSTER}

У Вашей учётной записи на {SITENAME} имеются неоднократные предупреждения.
У Вас в общем {WARNINGS} предупреждений, Если Вы превысите установленные {TOTAL_WARN} предупреждения ваша учётная запись блокируется.

Причины для этого могут быть разными, это предупреждение получено из-за этой темы:
{POST_URL}
которую Вы создали.

Вот - напоминание некоторых из пунктов, которые Вы приняли, когда Вы зарегистрировались, мы любезно просим Вас уважать их в будущем

Цитата:
"Вы соглашаетесь не размещать оскорбительных, угрожающих, клеветнических сообщений, порнографических сообщений, призывов к национальной розни и прочих сообщений, могущих нарушить соответствующие законы.
Попытки размещения таких сообщений могут привести к вашему немедленному отключению от форумов (при этом ваш провайдер будет поставлен в известность)"

Обратитесь к {WARNER}, который сделал Вам предупреждения в вашей теме за разъяснениями.


{EMAIL_SIG}
