Subject: Новый пароль активирован
Charset: windows-1251

Здравствуйте {USERNAME}

Вы получили это сообщение потому вы (или ещё кто-то) запросил новый пароль для вашей учётной записи на {SITENAME}. Если вы не запрашивали пароль, игнорируйте этот email, если сообщения продолжают поступать то свяжитесь с администратором сайта.

Чтобы использовать новый пароль, Вы должны активизировать его. Зделать это можно по ниже приведённой ссылке.

{U_ACTIVATE}

Для доступа к учётной записи спользуйте следующий пароль:

Пароль: {PASSWORD}

Вы можете изменить этот пароль самостоятельно через страницу профиля. Если у Вас возникли трудности, пожалуйста свяжитесь с администратором сайта.

{EMAIL_SIG}
